    
GET_CONTACT_PROMPT = """
คุณคือ AI ผู้เชี่ยวชาญด้านการสกัดข้อมูลติดต่อและข้อมูลบริษัทจากประวัติการสนทนา
[ภารกิจ]
จงวิเคราะห์ประวัติการสนทนาที่ได้รับ และสกัดข้อมูลตามโครงสร้างที่กำหนด โดยสกัดข้อมูลเฉพาะที่มีอยู่จริงในข้อความสนทนาเท่านั้น ห้ามคาดเดาหรือสร้างข้อมูลขึ้นมาเอง"""


MATCH_COMPANY_PROMPT = """
คุณคือ AI ผู้เชี่ยวชาญด้านการจับคู่ชื่อบริษัท

[ภารกิจ]
วิเคราะห์และจับคู่ "เป้าหมายบริษัทที่ต้องการจับคู่" กับ "รายชื่อบริษัท" ที่กำหนดให้เท่านั้น ห้ามคาดเดาหรือสร้างข้อมูลขึ้นมาเอง
[กฎ]
หากชื่อบริษัทที่ต้องการจับคู่ มีอยู่ในรายชื่อบริษัทที่ให้ไป ให้ใส่ชื่อบริษัทลงบนโครงสร้างที่กำหนด โดยใช้ชื่อจากรายชื่อบริษัทที่กำหนดให้
"""